[
  {
    "text": "Best food in San Fran! \n\nThe first time we decided to come here I was so worried it wouldn't be good and would be more of a \"tourist\" stop. Boy was I...",
    "rating": 5,
    "business_name": "Fog_Harbor_Fish_House"
  },
  {
    "text": "I've you've walked (or yelped) around looking for somewhere to grab some clam chowder, you're well-aware that there's more than a handful of options. One...",
    "rating": 4,
    "business_name": "Fog_Harbor_Fish_House"
  },
  {
    "text": "So I probably added Fog Harbor to my bookmarks on Yelp right when In moved to SF, 2 years ago. Finally on Valentines day 2020, my bf and I tried it...cliche...",
    "rating": 5,
    "business_name": "Fog_Harbor_Fish_House"
  },
  {
    "text": "The epitome of asian fusion\n\nI came here for my birthday dinner, which was a Friday night. Even with reservation, we had to wait for about 30 minutes after...",
    "rating": 5,
    "business_name": "The_House"
  },
  {
    "text": "A hidden GEM in San Francisco! \nWell maybe not that hidden, because the place was packed. Despite that, we were seated exactly at our reservation time, the...",
    "rating": 4,
    "business_name": "The_House"
  },
  {
    "text": "Five stars  is what this restaurant deserved! My family all loved it !!!! We loved the sea bass so much that each of my family member order our own. \nThe...",
    "rating": 5,
    "business_name": "The_House"
  },
  {
    "text": "I've been wanting to try Liholiho Yachy Club for years. Great reviews, amazing looking Hawaiian-fusion cuisine. The holdup has been reservations, groups,...",
    "rating": 5,
    "business_name": "Liholiho_Yacht_Club"
  },
  {
    "text": "I have had this spot book marked foreverrrrrr. So many things on their menu caught my eye. One night after bebopping in The City, I stopped in here, right...",
    "rating": 4,
    "business_name": "Liholiho_Yacht_Club"
  },
  {
    "text": "I had a very enjoyable time at Liholiho Yacht Club! I came here for a cute date night, and I have to say this is such a beautiful location for that kind of...",
    "rating": 4,
    "business_name": "Liholiho_Yacht_Club"
  },
  {
    "text": "Had some time so did a little driving to get to Daughter Thai's sister restaurant. Did not disappoint. Food came out quickly and was done well....",
    "rating": 5,
    "business_name": "Farmhouse_Kitchen_Thai_Cuisine"
  },
  {
    "text": "The food is just okay, but not worth it for the price it comes with. This place is definitely more hyped than anything since the concept of \"blue rice\" is...",
    "rating": 3,
    "business_name": "Farmhouse_Kitchen_Thai_Cuisine"
  },
  {
    "text": "As Gordon Ramsay says, \"If you can't stand the heat, get out of the kitchen!\" BEWARE if you're not a huge fan of spicy foods I'd suggest you turn around....",
    "rating": 4,
    "business_name": "Farmhouse_Kitchen_Thai_Cuisine"
  },
  {
    "text": "I made brunch reservations 2 weeks prior to the Sunday of Valentine's weekend. Unfortunately, I had to push back our reservations, and it was pretty...",
    "rating": 4,
    "business_name": "The_Front_Porch"
  },
  {
    "text": "2/29/20\n\nI want to say first: my gf wholeheartedly disagrees with this review.  She thinks the food was great.  But I don't care.  You deserve to be told...",
    "rating": 2,
    "business_name": "The_Front_Porch"
  },
  {
    "text": "What in the CAUCASIAN is going on here?! The flavors are watered down. This place is way overhyped and way overpriced for the food they're selling. Their...",
    "rating": 1,
    "business_name": "The_Front_Porch"
  },
  {
    "text": "One of the best meals I've ever had \nThe food was fresh and flavorful and the staff was friendly and patient \nI'll be a regular in here",
    "rating": 5,
    "business_name": "Tuba_Authentic_Turkish_Restaurant"
  },
  {
    "text": "Excellent place, great hospitality, and good food. \nDo Not make mistake other Tuba Resturant's in Palo Alto and others are not related  to these guys.  \nI...",
    "rating": 4,
    "business_name": "Tuba_Authentic_Turkish_Restaurant"
  },
  {
    "text": "Came here for dinner and the place was packed. We had a res but waited about 15 min to be seated.\n\nService was definitely slow.\n\nIt took a while to finally...",
    "rating": 3,
    "business_name": "Tuba_Authentic_Turkish_Restaurant"
  },
  {
    "text": "This is the most incredible neighborhood restaurant! Our FAVORITE place in the Marina over the last year. Every dish is delicious, the ambience is lively,...",
    "rating": 5,
    "business_name": "MaMo"
  },
  {
    "text": "A cozy spot in the marina with lots of great dishes. The atmosphere is very calming since the space is small so the noise level doesn't get too high. All of...",
    "rating": 4,
    "business_name": "MaMo"
  },
  {
    "text": "Small neighborhood spot with some yummy food! I wish their outdoor patio area was a bit more roomy because we came with our dog and it was a bit tight with...",
    "rating": 4,
    "business_name": "MaMo"
  },
  {
    "text": "This is the best experience from all these years' visits to Cheesecake Factory. Our server is very attentive. I asked for wheat bread but it was out at the...",
    "rating": 5,
    "business_name": "The_Cheesecake_Factory"
  },
  {
    "text": "This is a major tourist trap located in the heart of Union Square with a killer view.\n\nHorrible service every time my coworkers and I come here and...",
    "rating": 3,
    "business_name": "The_Cheesecake_Factory"
  },
  {
    "text": "Came here on a Sunday night, and the wait was crazy. The most interesting thing is the waiting system. They gave you a buzzer when you come in and put your...",
    "rating": 3,
    "business_name": "The_Cheesecake_Factory"
  },
  {
    "text": "Son & Garden has attentive & friendly service staff, coupled with exceptionally presented and delicious food. The floral decor provides a fun dining...",
    "rating": 5,
    "business_name": "Son_&_Garden"
  },
  {
    "text": "Parked around the corner on Eddy Street. The car in front of me had a broken window, so park at your own risk. Had a reservation for 3 on a Sunday morning...",
    "rating": 5,
    "business_name": "Son_&_Garden"
  },
  {
    "text": "This lovely restaurant is so cute. The parking around this area is a bit sketchy. But overall it was worth a try at this place. \n\nTheir items are pricey,...",
    "rating": 4,
    "business_name": "Son_&_Garden"
  },
  {
    "text": "The restaurant looks (and sounds) pretty reasonable when you enter, but beware sitting downstairs where it's extremely loud and crammed. Thankfully, when we...",
    "rating": 4,
    "business_name": "Limón_Rotisserie"
  },
  {
    "text": "I've been to Limon in Walnut Creek a bunch of times and a always had the best experience. I wanted my friends from different parts to try it, so we picked...",
    "rating": 3,
    "business_name": "Limón_Rotisserie"
  },
  {
    "text": "ROAST CHICKEN!!! \n                               ~-.\n          ,,,;            ~-.~-.~-\n         (.../           ~-.~-.~-.~-.~-.\n      4} XX~`,...",
    "rating": 5,
    "business_name": "Limón_Rotisserie"
  },
  {
    "text": "I came here for brunch on a Sunday with 4 others. There was about a 2 hour wait but we went to a nearby cafe for a drink so it was no issue. \n\nThe champagne...",
    "rating": 5,
    "business_name": "Zazie"
  },
  {
    "text": "Yum!! Such a cute little brunch spot! We went on Presidents' Day and the place was absolutely PACKED. In true San Francisco fashion we put our name on a...",
    "rating": 5,
    "business_name": "Zazie"
  },
  {
    "text": "Zazie is easily on my shortlist of favorite brunch spots. The food,ambience,service and decor are all fantastic. Especially Mario who is a pro at taking...",
    "rating": 5,
    "business_name": "Zazie"
  },
  {
    "text": "I first want to thank the staff here for their hard work and attentiveness.  It's a lot of work to deal with the masses of hungry people wanting their...",
    "rating": 5,
    "business_name": "Marufuku_Ramen_SF"
  },
  {
    "text": "Try coming on a weeknight to avoid the worth of the lines.  My brother and I came here on a Wednesday night around 6:30 and only waited 40 mins.  With Yelp,...",
    "rating": 4,
    "business_name": "Marufuku_Ramen_SF"
  },
  {
    "text": "AMAZING Ramen, known as the best in SF. \n\nThe wait here if terrible, like honestly terrible. The restaurant itself is super small, and there really isn't a...",
    "rating": 5,
    "business_name": "Marufuku_Ramen_SF"
  },
  {
    "text": "Kokkari gets a 4 for the food from me, but the service here bumps it up the extra star. Usually I expect service to be decent at most restaurants, but our...",
    "rating": 5,
    "business_name": "Kokkari_Estiatorio"
  },
  {
    "text": "*****\nThis is a ten star restaurant. I love everything here on the menu. My favorite is the chicken. I also love the whole fish selections and the pit is...",
    "rating": 5,
    "business_name": "Kokkari_Estiatorio"
  },
  {
    "text": "Made a reservation for a Friday night and went there an hour early hoping to be seated sooner and they were nice enough to get us a table early. The service...",
    "rating": 5,
    "business_name": "Kokkari_Estiatorio"
  },
  {
    "text": "Came here for my birthday weekend. Had a 1920s theme party and planned on going to check out a few speakeasies after dinner. 2nd stop totally memorable....",
    "rating": 5,
    "business_name": "The_Pawn_Shop"
  },
  {
    "text": "Take public transportation!  \n\nIf no reservations their wait time can be about an hour but no problem just went to a bar close by.\n\nVenue was a bit loud but...",
    "rating": 4,
    "business_name": "The_Pawn_Shop"
  },
  {
    "text": "Cool speakeasy hidden away behind a cheesy storefront. Really liked how the guy behind the counter at the cheesy store asked me to 1) pawn something 2) tell...",
    "rating": 4,
    "business_name": "The_Pawn_Shop"
  },
  {
    "text": "Short version: best overall dining experience of my life. \nDetails: \n-valet is $20. \n-Our five course dinner took three hours (we took our time and enjoyed...",
    "rating": 5,
    "business_name": "Gary_Danko"
  },
  {
    "text": "When I was much younger, I found a notebook laptop.  I gave it to my friend to fix.  He \"lost it.\"  I didn't believe him.  But then he said he'd treat me to...",
    "rating": 5,
    "business_name": "Gary_Danko"
  },
  {
    "text": "I won't lie, Gary Danko gave off a very pretentious vibe that made my partner and I feel slightly uncomfortable the entire night. To top it all off, we only...",
    "rating": 3,
    "business_name": "Gary_Danko"
  },
  {
    "text": "I planned to go for weekend dinner with my parents, so I used Yelp's waitlist reservation about 30 mins before I left my house around 5:30pm. We arrived but...",
    "rating": 4,
    "business_name": "um.ma"
  },
  {
    "text": "Made a reso for 8:15. Was Told by the seating hostess that they stop serving by 830. I said really? Because on your Yelp page you can make a reservation up...",
    "rating": 3,
    "business_name": "um.ma"
  },
  {
    "text": "The flavor of this place is nice, and I enjoyed the charm of the area given that the name \"um.ma\" means mom in Korean, and there are multiple pictures /...",
    "rating": 2,
    "business_name": "um.ma"
  },
  {
    "text": "Long due for a review. This is hands down our favorite place in all of Bay Area. The food, the ambiance and the cocktails just makes it the perfect...",
    "rating": 5,
    "business_name": "Loló"
  },
  {
    "text": "My friends and I were trying to decide on a place for brunch in the Mission, and when I found that Loló had been in my bookmarks for a while and also took...",
    "rating": 4,
    "business_name": "Loló"
  },
  {
    "text": "The Ambiance, waiting staff, drinks are all good.  The menu is creative and exciting...\n\nHOWEVER, the menus should be updated..as it has not changed at all...",
    "rating": 3,
    "business_name": "Loló"
  },
  {
    "text": "Stumbled across the Kitchen Story while exploring San Francisco during a girls weekend getaway...it was our lucky day! \n\nThe line outside looked...",
    "rating": 5,
    "business_name": "Kitchen_Story"
  },
  {
    "text": "There is no doubt that Kitchen Story is a Castro neighborhood favorite, as evident by the constant line around the block to get in or any weekend day. \n\nI...",
    "rating": 4,
    "business_name": "Kitchen_Story"
  },
  {
    "text": "Did you know this place was started by the same people who started dessert story, Surisan, sweet maple, and Blackwood? \n\nI've been wondering why everytime I...",
    "rating": 4,
    "business_name": "Kitchen_Story"
  },
  {
    "text": "i was told about this place, but it wasn't at all like i pictured it. it's not a bad thing, it was just different. i was picturing a fancy italian...",
    "rating": 4,
    "business_name": "Mona_Lisa_Restaurant"
  },
  {
    "text": "Don't be fool by the amount of reviews! This a tourist trap due to the location. I can see it being a very popular restaurant in the 80s and 90s, but we are...",
    "rating": 2,
    "business_name": "Mona_Lisa_Restaurant"
  },
  {
    "text": "This restaurant was a victim of its success the night I came. I was showing a big group of clients around San Francisco, my hometown, and I chose this...",
    "rating": 2,
    "business_name": "Mona_Lisa_Restaurant"
  },
  {
    "text": "Food: The sourdough garlic bread is DELICIOUS! It's 100% worth getting. My sister had the chowder in the bread bowl which was super tasty and creamy. I...",
    "rating": 4,
    "business_name": "Pier_Market_Seafood_Restaurant"
  },
  {
    "text": "Popped my clam chowder cherry . Right in the middle of pier 39 where random commercialized shops are scattered all about. There is an outdoor stand with...",
    "rating": 4,
    "business_name": "Pier_Market_Seafood_Restaurant"
  },
  {
    "text": "Loved loved loved this place. I came here a couple of times and plan on coming again and again to be sure of not being disappointed. \n\nI have tried they...",
    "rating": 5,
    "business_name": "Pier_Market_Seafood_Restaurant"
  },
  {
    "text": "So my student wanted to have some Japanese food, but not sushi, so I did a bit of research (Thank you, Yelp!) and found this gem! May I say that this place...",
    "rating": 4,
    "business_name": "Skool"
  },
  {
    "text": "I've been hearing about Skool for a couple years now and finally got to try it! \n\nMade reservations online and was seated as soon as we got there. \n\nWe...",
    "rating": 5,
    "business_name": "Skool"
  },
  {
    "text": "Came here for date night with the fiancé and couldn't be happier with the choice. We made a reservation for 6 and the restaurant was still empty. By the...",
    "rating": 4,
    "business_name": "Skool"
  },
  {
    "text": "Came here for brunch with some friends. The Dorian has a relaxed atmosphere with some upscale features. We sat at one of the large booths on the perimeter...",
    "rating": 4,
    "business_name": "The_Dorian"
  },
  {
    "text": "A surprisingly sophisticated bar in the heart of the Marina! Who would've thunk? I've seen numerous restaurants in this Chestnut/Fillmore location over the...",
    "rating": 4,
    "business_name": "The_Dorian"
  },
  {
    "text": "This place is very busy so make a reservation if coming on a weekend unless you're okay with just standing and ordering drinks at the bar.\nWe had...",
    "rating": 4,
    "business_name": "The_Dorian"
  },
  {
    "text": "This was the first place I tried and was not disappointed at the recommendation of the group I was with. It is nestled on the pier and my receipt say pier...",
    "rating": 5,
    "business_name": "Scoma's_Restaurant"
  },
  {
    "text": "I'm a local, and I eat on the San Francisco waterfront often. This is definitely one of the best meals I've had near the Pier 39 / fisherman's wharf area....",
    "rating": 4,
    "business_name": "Scoma's_Restaurant"
  },
  {
    "text": "10/10 experience! I accompanied my boyfriend on a business trip and he happens to have long time friends who live nearby so we planned a nice dinner while...",
    "rating": 5,
    "business_name": "Scoma's_Restaurant"
  },
  {
    "text": "This place is great. We had Boston Clam Chowder followed by Risotto with Seafood (Chef's Choice) and Linguini with Seafood. It was all done well and the...",
    "rating": 5,
    "business_name": "Sotto_Mare_Oysteria_&_Seafood"
  },
  {
    "text": "Soto Mare is a really popular place in little Italy, and you can tell immediately because there's always a horde of people waiting outside. We made a...",
    "rating": 4,
    "business_name": "Sotto_Mare_Oysteria_&_Seafood"
  },
  {
    "text": "Absolutely delicious seafood, good value and cool atmosphere.  I got the ciopinno.  \n\nI couldn't come close to finishing the dish, so asked for a to-go box....",
    "rating": 4,
    "business_name": "Sotto_Mare_Oysteria_&_Seafood"
  },
  {
    "text": "I have been wanting to come here for awhile now, and was finally able to last night.\n\nThe space is cool; it has an upscale hipster SF vibe which is cool if...",
    "rating": 5,
    "business_name": "Nopa"
  },
  {
    "text": "I cannot believe the horrible experience I had here last night!!! Let me start by saying I have been coming to this restaurant consistently for the last 7...",
    "rating": 1,
    "business_name": "Nopa"
  },
  {
    "text": "Vibe of the restaurant was great.\n\nService was excellent.\n\nCoffee was divine. \n\nFood was satisfying.\n\nI think the only part that was off was the noise of...",
    "rating": 4,
    "business_name": "Nopa"
  },
  {
    "text": "Came here on a Sunday night for a birthday and got the pre fix menu! Warning: that was too much food for the 7 of us and we all left with way too many...",
    "rating": 4,
    "business_name": "Noosh"
  },
  {
    "text": "My friends and I decided to eat here after a workout on a Saturday. I had been excited to try this place ever since it opened. We got here right at 11 and a...",
    "rating": 1,
    "business_name": "Noosh"
  },
  {
    "text": "This place is so Fillmore. So light and airy and kinda sterile to appease Pac Heights types presumably. It was a bit like walking onto the set of a tampon...",
    "rating": 4,
    "business_name": "Noosh"
  },
  {
    "text": "I really enjoy this place. It's in the outer sunset. You'd think it would be quiet, but it's busy and delicious. Four of us had a full feast. 3 appetizers,...",
    "rating": 5,
    "business_name": "Thanh_Long"
  },
  {
    "text": "Came here on a busy Saturday night and I was impressed by their roasted crab! It was well seasoned and bigger than most crab restaurants that I've been to....",
    "rating": 3,
    "business_name": "Thanh_Long"
  },
  {
    "text": "I used to come here often bc the food is simply delicious and the portions were decent enough to share. The price didn't matter before bc I would leave full...",
    "rating": 2,
    "business_name": "Thanh_Long"
  },
  {
    "text": "All of the dishes we ordered were delicious. The roasted eggplant was especially yummy.  Great service and comfortable setting. We'll definitely be back.",
    "rating": 5,
    "business_name": "Lark"
  },
  {
    "text": "Yeah, I'm in the \"3.5 stars but rounding up\" category too.\n\nWe had Saturday night dinner reservations, sneaking in a quick bite between films at the Silent...",
    "rating": 4,
    "business_name": "Lark"
  },
  {
    "text": "Great vibe and tasty food. The cocktail I ordered had a bit too much cinnamon but otherwise delicious. Great spot for a date night or wine/cocktails at the bar!",
    "rating": 4,
    "business_name": "Lark"
  },
  {
    "text": "Ughhh bring me back! I'm going to have dreams about this place. My sister and I shared the house of prime rib cut and paid the extra $10 to each get our own...",
    "rating": 5,
    "business_name": "House_Of_Prime_Rib"
  },
  {
    "text": "This restaurant bas been very hype, that too book the restaurant takes months before. \n\nHowever the food is okay, compare to other prime rib restaurant ive...",
    "rating": 3,
    "business_name": "House_Of_Prime_Rib"
  },
  {
    "text": "Darlene, our waitress, repeatedly placed her hand on my husband's shoulder during our dining experience. It was toward the end, and she would do it just as...",
    "rating": 3,
    "business_name": "House_Of_Prime_Rib"
  },
  {
    "text": "I havent been to Kou in a long time. This place is a great date destination and a cool drinking with friends venue. The food is on point - highly recommend...",
    "rating": 4,
    "business_name": "Izakaya_KOU"
  },
  {
    "text": "I came to this place twice, once with a group of friends and once with my parents. After coming with two groups of people, I'm impressed by how flexible one...",
    "rating": 4,
    "business_name": "Izakaya_KOU"
  },
  {
    "text": "This place is a hidden gem and I can't wait to return. We came here after craving tapas and thought we'd try  it out. I've gone past this place several...",
    "rating": 5,
    "business_name": "Izakaya_KOU"
  }
]